config.org
* Startup
** Early initialization
#+begin_src emacs-lisp :tangle early-init.el
(setq inhibit-startup-message t)
(setq inhibit-startup-screen t)

(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize t
      use-dialog-box t ; only for mouse events, which I seldom use
      use-file-dialog nil
      use-short-answers t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name
      inhibit-startup-buffer-menu t)

(setq mode-line-misc-info
      (delete (assoc 'minor-mode-alist mode-line-misc-info) mode-line-misc-info))

(add-hook 'after-init-hook (lambda () (set-frame-name "home")))

;; Modes
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)
(menu-bar-mode -1)
(tool-bar-mode 0)

;; settings for windows
(setq focus-follows-mouse t)

(add-to-list 'default-frame-alist '(alpha . (95 . 95)))

;; garbage collection
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

(defvar bard-emacs--file-name-handler-alist file-name-handler-alist)
(defvar bard-emacs--vc-handled-backends vc-handled-backends)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 1000 1000 8)
                  gc-cons-percentage 0.1
                  file-name-handler-alist bard-emacs--file-name-handler-alist
                  vc-handled-backends bard-emacs--vc-handled-backends)))

;; Package cache
(setq package-enable-at-startup t)

#+end_src

** Initialization
#+begin_src emacs-lisp :tangle init.el
;;; init.el --- init.el -*- lexical-binding: t -*-

;; Author: BardofSprites
;; Maintainer: BardofSprites
;; Version: 0.1.0
;; Package-Requires: ((emacs "28.2"))

;; This file is not part of GNU Emacs

;; This program is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.


;;; Commentary:

;;; Code:

;; fix keymap
(repeat-mode t)
(global-set-key (kbd "C-z") nil)
(global-set-key (kbd "M-z") nil)

(global-set-key (kbd "C-z C-z") #'suspend-emacs)


;; Add the directories to the load path
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("bard-elisp" "bard-emacs-modules" "old-ada"))

;; Clipboard saving
(setq select-enable-clipboard t)

;; custom file is evil
(setq custom-file (make-temp-file "emacs-custom-"))

;; No Backups
(setq auto-save-default nil)
(setq make-backup-files nil)
(setq confirm-kill-emacs 'y-or-n-p)

;; native comp enabled
(when (native-comp-available-p)
  (setq native-compile-prune-cache t))

;; enable/disable commands
(mapc
 (lambda (command)
   (put command 'disabled nil))
 '(list-timers narrow-to-region narrow-to-page upcase-region downcase-region))

(mapc
 (lambda (command)
   (put command 'disabled t))
 '(eshell project-eshell overwrite-mode iconify-frame diary))

;;; Packages
(setq package-archives '(("elpa" . "https://elpa.gnu.org/packages/")
                         ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                         ("melpa" . "https://melpa.org/packages/")))

;;; MACROS

(defmacro bard/make-abbrev (table &rest definitions)
  "Expand abbrev DEFINITIONS for the given TABLE.
DEFINITIONS is a sequence of (i) string pairs mapping the
abbreviation to its expansion or (ii) a string and symbol pair
making an abbreviation to a function."
  (declare (indent 1))
  (unless (zerop (% (length definitions) 2))
    (error "Uneven number of key+command pairs"))
  `(if (abbrev-table-p ,table)
       (progn
         ,@(mapcar
            (lambda (pair)
              (let ((abbrev (nth 0 pair))
                    (expansion (nth 1 pair)))
                (if (stringp expansion)
                    `(define-abbrev ,table ,abbrev ,expansion)
                  `(define-abbrev ,table ,abbrev "" ,expansion))))
            (seq-split definitions 2)))
     (error "%s is not an abbrev table" ,table)))

(require 'bard-emacs-anki)
(require 'bard-emacs-calendar)
(require 'bard-emacs-completion)
(require 'bard-emacs-dired)
;; (require 'bard-emacs-email)
(require 'bard-emacs-media)
(require 'bard-emacs-eshell)
(require 'bard-emacs-essentials)
;; (require 'bard-emacs-keyboard)
(require 'bard-emacs-modeline)
(require 'bard-emacs-org)
(require 'bard-emacs-prog)
(require 'bard-emacs-theme)
(require 'bard-emacs-ui)
(require 'bard-emacs-web)
(require 'bard-emacs-window)
(require 'bard-emacs-writing)

(provide 'init)
(put 'eshell 'disabled nil)

#+end_src
* Modules
** bard-emacs-anki
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-anki.el :mkdirp yes
(use-package anki-editor
  :ensure t
  :after org
  :bind (:map org-mode-map
              ("C-c M-i" . bard/anki-editor-cloze-region-auto-incr)
              ("C-c M-I" . bard/anki-editor-cloze-region-dont-incr)
              ("C-c M-r" . bard/anki-editor-reset-cloze-number)
              ("C-c M-p" . anki-editor-push-new-notes)
              ("C-c M-P" . anki-editor-push-notes))

  :hook (org-capture-after-finalize . bard/anki-editor-reset-cloze-number) ; Reset cloze-number after each capture.
  :config
  (setq anki-editor-create-decks t ;; Allow anki-editor to create a new deck if it doesn't exist
        anki-editor-org-tags-as-anki-tags t)

  (defun bard/anki-editor-cloze-region-auto-incr (&optional arg)
    "Cloze region without hint and increase card number."
    (interactive)
    (anki-editor-cloze-region my-anki-editor-cloze-number "")
    (setq my-anki-editor-cloze-number (1+ my-anki-editor-cloze-number))
    (forward-sexp))
  (defun bard/anki-editor-cloze-region-dont-incr (&optional arg)
    "Cloze region without hint using the previous card number."
    (interactive)
    (anki-editor-cloze-region (1- my-anki-editor-cloze-number) "")
    (forward-sexp))
  (defun bard/anki-editor-reset-cloze-number (&optional arg)
    "Reset cloze number to ARG or 1"
    (interactive)
    (setq my-anki-editor-cloze-number (or arg 1)))
  ;; Initialize
  (bard/anki-editor-reset-cloze-number)
  )

(provide 'bard-emacs-anki)
#+end_src

** bard-emacs-calendar
*** Load required libraries
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  (require 'bard-calendar)
  (require 'hi-lock)
#+end_src

*** Org directory and agenda files
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  (setq org-directory "~/Notes/denote/")
  ;; symlinked file to shorten denote file name in agenda buffers
  (setq org-agenda-files (list "~/Notes/denote/todo.org" "~/Notes/denote/uni.org"))
#+end_src

*** Org Calendar
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  ;; Calendar
  (use-package calendar-mode
    :config
    (setq calendar-holidays (append calendar-holidays russian-holidays))
    :hook
    (calendar-today-visible . calendar-mark-today)
    (calendar-mode . denote-journal-calendar-mode)
    (calendar-today-visible . calendar-mark-holidays))

  (use-package orthodox-christian-new-calendar-holidays
    :ensure t
    :config
    (setq holiday-other-holidays (append holiday-other-holidays orthodox-christian-new-calendar-holidays))

    (setq holiday-bahai-holidays nil
          holiday-christian-holidays nil
          holiday-islamic-holidays nil))
#+end_src

*** Org todo keywords
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  ;; Org todo keywords - changed to using hl-todo faces fixed by modus/ef themes
  (setq org-todo-keywords
        '((sequence "TODO(t)" "EXTRA(e)" "INPROG(i)" "|" "DONE(d)" "KILLED(k)")
          (sequence "MEET(m)" "TENT(T)" "|" "MET(M)" "NOGO(n)")))

  (setq org-todo-keyword-faces
        '(("EXTRA" . (:inherit warning))
          ("TENT" . (:inherit warning))
          ("MEET" . (:inherit warning underline bold))
          ("INPROG" . (:inherit hi-yellow :weight bold))))

  (setq org-enforce-todo-dependencies t)

  ;; Automatically clock in
  (add-hook 'org-after-todo-state-change-hook #'bard/auto-clock-in)
#+end_src

*** Org clocking
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  ;; clock tables
  (setq org-clock-clocktable-default-properties '(:maxlevel 7 :scope agenda)
        org-clock-persist 'history
        org-clock-mode-line-total 'current)
  (org-clock-persistence-insinuate)

  (use-package org
    :demand t
    :hook
    ((org-clock-out . bard/org-clock-update-mode-line)))
#+end_src

*** Org agenda settings
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  (global-set-key (kbd "<f1>") 'bard/default-agenda)
  (global-set-key (kbd "M-<f1>") 'bard/choose-agenda)

  (setq org-agenda-include-diary t)
  (setq org-agenda-custom-commands
        `(("D" "Daily agenda and top priority tasks"
           ((tags-todo "!TODO"
                       ((org-agenda-overriding-header "Unscheduled Tasks \n")
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'timestamp))))
            (agenda "" ((org-agenda-span 1)
                        (org-agenda-start-day nil)
                        (org-deadline-warning-days 14)
                        ;; (org-scheduled-past-days 0)
                        (org-agenda-day-face-function (lambda (date) 'org-agenda-date))
                        (org-agenda-format-date "%A %-e %B %Y")
                        (org-agenda-overriding-header "Today's agenda \n")))
            (agenda "" ((org-agenda-span 8)
                        (org-calendar-holiday)
                        (org-deadline-warning-days 0)
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "Upcoming this week \n")))))
          ("Y" "Yearly view for all tasks"
           ((agenda "" ((org-agenda-span 365)
                        (org-deadline-warning-days 2)
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "Upcoming this Year\n")))))
          ("M" "Monthly view for all tasks"
           ((agenda "" ((org-agenda-span 31)
                        (org-deadline-warning-days 2)
                        (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                        (org-agenda-overriding-header "Upcoming this month\n")))))))
#+end_src

*** Org habit
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  (use-package org-habit
    :after org-agenda
    :config
    (setq org-habit-show-done-always-green t
          org-habit-show-habits t
          org-habit-show-all-today t)
    )
#+end_src

*** Provide module
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-calendar.el :mkdirp yes
  (provide 'bard-emacs-calendar)
#+end_src

** bard-emacs-completion
*** Vertico completion framework
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-completion.el :mkdirp yes
  ;; minibuffer completion
  (use-package vertico
    :ensure t
    :config
    (setq vertico-scroll-margin 0)
    (setq vertico-cycle nil)
    (setq vertico-resize nil)
    (vertico-mode t)

    (with-eval-after-load 'rfn-eshadow
      ;; This works with `file-name-shadow-mode' enabled.  When you are in
      ;; a sub-directory and use, say, `find-file' to go to your home '~/'
      ;; or root '/' directory, Vertico will clear the old path to keep
      ;; only your current input.
      (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy))
    )
#+end_src

