bard-emacs-modules/bard-emacs-completion.el
;; minibuffer completion
(use-package vertico
  :ensure t
  :config
  (vertico-mode 1)
  (setq vertico-scroll-margin 0)
  (setq vertico-cycle t)

  (with-eval-after-load 'rfn-eshadow
    ;; This works with `file-name-shadow-mode' enabled.  When you are in
    ;; a sub-directory and use, say, `find-file' to go to your home '~/'
    ;; or root '/' directory, Vertico will clear the old path to keep
    ;; only your current input.
    (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy))
  )
