config.org
*** Provide module
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-completion.el :mkdirp yes
  (provide 'bard-emacs-completion)
  ;;; bard-emacs-completion.el ends here
#+end_src

** bard-emacs-dired
*** Dired subtree
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-dired.el :mkdirp yes
  (use-package dired-subtree
    :ensure t
    :config
    (setq dired-subtree-use-backgrounds nil))
#+end_src

*** Dired file preview
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-dired.el :mkdirp yes
  (use-package dired-preview
    :ensure t
    :bind
    (:map dired-mode-map
          ("P" . dired-preview-mode))
    :config
    (setq dired-preview-delay 0.1))
#+end_src

*** General dired settings
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-dired.el :mkdirp yes
  (use-package dired
    :bind*
    (("C-j" . dired-jump))
    :bind (:map dired-mode-map
                (("E" . emms-add-dired)
                 ("<tab>" . dired-subtree-toggle)
                 ("<backtab>" . dired-subtree-cycle)))
    :config
    (setq dired-guess-shell-alist-user ; those are the suggestions for ! and & in Dired
          '(("\\.\\(png\\|jpe?g\\|tiff\\)" "nsxiv" "feh" "xdg-open")
            ("\\.\\(mp[34]\\|m4a\\|ogg\\|flac\\|webm\\|mkv\\)" "mpv" "xdg-open")
  	      (".gif" "mpv --loop=inf")
            (".*" "xdg-open")))
    (setq dired-dwim-target t)
    (setq dired-listing-switches
          "-AgGFhlv --group-directories-first --time-style=long-iso")
    :hook
    ((dired-mode . dired-hide-details-mode)
     ;; attachments for email through dired
     (dired-mode . turn-on-gnus-dired-mode)))
#+end_src

*** Image dired
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-dired.el :mkdirp yes
  (use-package image-dired
    :bind
    (:map dired-mode-map
          ((")" . image-dired-dired-display-external)
           ("B" . bard/dired-set-background-with-feh)))
    :bind
    ("C-x C-d" . image-dired)
    :bind
    (:map image-dired-thumbnail-mode-map ("B" . bard/image-dired-set-background-with-feh))
    :config
    (define-advice image-dired-display-image (:override (file &optional _ignored))
      (setq file (expand-file-name file))
      (when (not (file-exists-p file))
        (error "No such file: %s" file))
      (let ((buf (get-buffer image-dired-display-image-buffer))
            (cur-win (selected-window)))
        (when buf
          (kill-buffer buf))
        (when-let ((buf (find-file-noselect file nil t)))
          (with-current-buffer buf
            (rename-buffer image-dired-display-image-buffer)
            (if (string-match (image-file-name-regexp) file)
                (image-dired-image-mode)
              ;; Support visiting PDF files.
              (normal-mode))
            (display-buffer buf))
          (select-window cur-win))))

    (setq image-dired-thumbnail-storage 'standard)
    (setq image-dired-external-viewer "nsxiv")
    (setq image-dired-thumb-size 80)
    (setq image-dired-thumb-margin 2)
    (setq image-dired-thumb-relief 0)
    (setq image-dired-thumbs-per-row 4)

    (defun bard/dired-set-background-with-feh ()
      "Set the selected image as the background using feh."
      (interactive)
      (let ((image-file (dired-get-file-for-visit)))
        (start-process "feh" nil "feh" "--bg-fill" image-file)
        (message "Background set to %s" image-file)))

    (defun bard/image-dired-set-background-with-feh ()
      "Set the selected image as the background using feh."
      (interactive)
      (let ((image-file (image-dired-original-file-name)))
        (start-process "feh" nil "feh" "--bg-fill" image-file)
        (message "Background set to %s" image-file))))
#+end_src

*** Running commands on dired files
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-dired.el :mkdirp yes
  ;; Taken from https://superuser.com/a/176629
  (defun bard/dired-do-command (command)
    "Run COMMAND on marked files. Any files not already open will be opened.
  After this command has been run, any buffers it's modified will remain
  open and unsaved."
    (interactive "CRun on marked files M-x ")
    (save-window-excursion
      (mapc (lambda (filename)
              (find-file filename)
              (call-interactively command))
            (dired-get-marked-files))))
#+end_src

*** Dired video thumbnails
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-dired.el :mkdirp yes
  (use-package dired-video-thumbnail
    :ensure t
    :vc (:url "https://github.com/captainflasmr/dired-video-thumbnail"
              :rev :newest)
    :bind (:map dired-mode-map
                ("C-t v" . dired-video-thumbnail)))
#+end_src

*** Provide module
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-dired.el :mkdirp yes
  (provide 'bard-emacs-dired)
#+end_src

** bard-emacs-email
*** Require email library
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  (require 'bard-email)
#+end_src

*** Notmuch mail client settings
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  (use-package notmuch
    :ensure t
    :config
    (define-key global-map (kbd "C-c m") #'notmuch)
    (setq notmuch-show-logo t
          notmuch-column-control 1.0
          notmuch-hello-auto-refresh t
          notmuch-hello-recent-searches-max 20
          notmuch-hello-thousands-separator ""
          notmuch-hello-sections '(notmuch-hello-insert-header notmuch-hello-insert-saved-searches notmuch-hello-insert-search notmuch-hello-insert-alltags)
          notmuch-show-all-tags-list t)

    (setq notmuch-search-oldest-first nil)
    (setq notmuch-show-seen-current-message t)

    (defun bard/notmuch-mua-empty-subject-check ()
      "Request confirmation before sending a message with empty subject."
      (when (and (null (message-field-value "Subject"))
                 (not (y-or-n-p "Subject is empty, send anyway? ")))
        (error "Sending message cancelled: empty subject")))
    (add-hook 'message-send-hook 'bard/notmuch-mua-empty-subject-check))
#+end_src

**** Notmuch saved searches
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  (setq notmuch-show-empty-saved-searches t)
  (setq notmuch-saved-searches
        `(( :name "📥 inbox (all-mail)"
            :query "tag:inbox"
            :sort-order newest-first
            :key ,(kbd "i"))
          ( :name "💬 unread (inbox)"
            :query "tag:unread and tag:inbox"
            :sort-order newest-first
            :key ,(kbd "u"))
          ( :name "📝 To Do"
            :query "tag:todo"
            :sort-order oldest-first
            :key ,(kbd "t"))
          ( :name "🚩 flagged"
            :query "tag:flag"
            :sort-order newest-first
            :key ,(kbd "f"))
          ( :name "🐃 contributions"
            :query "tag:unread and tag:contrib"
            :sort-order newest-first
            :key ,(kbd "c"))
          ( :name "🐧 linux-related"
            :query "tag:unread and tag:linux"
            :sort-order newest-first
            :key ,(kbd "l"))
          ( :name "🚂 emacs developement"
            :query "tag:unread and tag:contrib"
            :sort-order newest-first
            :key ,(kbd "ed"))
          ( :name "🎨 emacs humanities"
            :query "tag:unread and tag:emacs-humanities"
            :sort-order newest-first
            :key ,(kbd "eh"))
          ( :name "🦄 emacs org-mode"
            :query "tag:unread and tag:emacs-org"
            :sort-order newest-first
            :key ,(kbd "eo"))))
#+end_src

**** Tagging keys
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  (setq notmuch-tagging-keys
        `((,(kbd "d") prot-notmuch-mark-delete-tags "💥 Mark for deletion")
          (,(kbd "f") prot-notmuch-mark-flag-tags "🚩 Flag as important")
          (,(kbd "s") prot-notmuch-mark-spam-tags "🔥 Mark as spam")
          (,(kbd "r") ("-unread") "👁️‍🗨️ Mark as read")
          (,(kbd "u") ("+unread") "🗨️ Mark as unread")))

  (setq notmuch-archive-tags '("+archive")
        notmuch-message-replied-tags '("+replied")
        notmuch-message-forwarded-tags '("+forwarded")
        notmuch-show-mark-read-tags '("-unread")
        notmuch-draft-tags '("+draft")
        notmuch-draft-folder "drafts"
        notmuch-draft-save-plaintext 'ask)
#+end_src

*** Notmuch modeline indicator
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  (use-package notmuch-indicator
    :ensure t
    :after notmuch
    :config
    (setq notmuch-indicator-args
          '(( :terms "tag:unread and tag:inbox"
              :label "[U] "
              :label-face prot-modeline-indicator-green
              :counter-face prot-modeline-indicator-green)
            ( :terms "tag:unread and tag:linux"
              :label "[L] "
              :label-face prot-modeline-indicator-cyan
              :counter-face prot-modeline-indicator-cyan)
            ( :terms "tag:unread and tag:emacs"
              :label "[E] "
              :label-face prot-modeline-indicator-blue
              :counter-face prot-modeline-indicator-blue))

          notmuch-indicator-refresh-count (* 60 3)
          notmuch-indicator-hide-empty-counters t
          notmuch-indicator-force-refresh-commands '(notmuch-refresh-this-buffer))
    (setq notmuch-indicator-add-to-mode-line-misc-info nil)
    (notmuch-indicator-mode t))
#+end_src

*** Org links for notmuch
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  (use-package ol-notmuch
    :ensure t
    :after notmuch)
#+end_src

*** Send mail and smtp settings
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  ;; use msmtp
  (setq sendmail-program "/usr/bin/msmtp"
        message-send-mail-function 'message-send-mail-with-sendmail
        message-sendmail-f-is-evil nil
        mail-specify-envelope-from t
        message-sendmail-envelope-from 'header
        mail-envelope-from t)
#+end_src

*** Provide module
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-email.el :mkdirp yes
  (provide 'bard-emacs-email)
#+end_src

