config.org
** bard-emacs-eshell
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-eshell.el :mkdirp yes
(use-package eshell
  :ensure nil
  :bind
  (("C-z e" . eshell-switcher))
  :config
  (require 'bard-eshell)
  (require 'ffap)
  ;; (setq eshell-banner-message "Time for another recreational programming session.\n\n")
  (setq eshell-banner-message
        '(format "%s %s\n %s\n"
                 (propertize (format " %s " (string-trim (buffer-name)))
                             'face 'mode-line-highlight)
                 (propertize (current-time-string)
                             'face 'font-lock-keyword-face)
         (propertize "Time for another recreational programming session."
                     'face 'warning)))
  (setq bard/eshell-aliases
        '((g   . magit)
          (gl  . magit-log)
          (d   . dired)
          (o   . find-file)
          (oo . find-file-other-window)
          (vim . find-file)
          (l  . (lambda () (eshell/ls '-la)))
          (eshell/clear . eshell/clear-scrollback)))

  (mapc (lambda (alias)
          (defalias (car alias) (cdr alias)))
        bard/eshell-aliases))

(use-package eshell
  :ensure nil
  :after esh-mode
  :bind
  (:map eshell-mode-map
        ("C-c C-e" . prot-eshell-export)
        ("M-k"     . eshell-kill-input)
        ("C-c C-d"   . prot-eshell-complete-recent-dir)
        ("C-c C-h"   . prot-eshell-narrow-output-highlight-regexp)
        ("C-c C-f"   . bard/eshell-find-file-at-point)))

(provide 'bard-emacs-eshell)
#+end_src

** bard-emacs-essentials
*** Writable grep buffers (wgrep)
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes

  (use-package wgrep
    :ensure t
    :bind
    (:map wgrep-mode-map
  	    ("C-x C-s" . wgrep-save-all-buffers)
          ("C-x C-q" . wgrep-change-to-wgrep-mode)
          ("C-c C-c" . wgrep-finish-edit))
    :bind
    (:map grep-mode-map
          ("e" . wgrep-change-to-wgrep-mode)))
#+end_src

#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  (use-package multiple-cursors
    :ensure t
    :config
    (setq mc/always-run-for-all t)
    :bind
    (("C-S-c C-S-c" . mc/edit-lines)
     ("C->" . mc/mark-next-like-this)
     ("C-<" . mc/mark-previous-like-this)
     ("C-c C" . mc/mark-all-like-this)
     ("C-\"". mc/skip-to-next-like-this)
     ("C-;" . mc/skip-to-previous-like-this)))
#+end_src

#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  (use-package expand-region
    :ensure t
    :bind ("C-=" . er/expand-region))
#+end_src

#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  (use-package substitute
    :ensure t
    :bind
    (("C-c s b" . substitute-target-below-point)
     ("C-c s a" . substitute-target-above-point)
     ("C-c s d" . substitute-target-in-defun)
     ("C-c s s" . substitute-target-in-buffer)))
#+end_src

#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  ;; Desktop mode/session saving
  (setq desktop-path '("~/.emacs.d/desktop")
        desktop-dirname "~/.emacs.d/desktop/"
        desktop-base-file-name "emacs-desktop"
        desktop-save t
        desktop-restore-eager t
        desktop-restore-=frams t
        desktop-restory-in-current-display t
        desktop-files-not-to-save "\(^$\\|\\*scratch\\*\\|\\*Messages\\*\\|\\*dashboard\\*\\|\\*Async-native-compile-log\\*|\\*Music\\*)")
  ;; (desktop-save-mode t)
  (global-set-key (kbd "C-z s") 'desktop-save-in-desktop-dir)
  (global-set-key (kbd "C-z r") 'desktop-read)

#+end_src

*** Scratch buffers
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  ;; Text Scratch buffers
  (defun bard/new-org-buffer ()
    (interactive)
    (let ((xbuf (generate-new-buffer "*org*")))
      (switch-to-buffer xbuf)
      (funcall (quote org-mode))
      (text-scale-increase 1.5)
      xbuf))
  (define-key global-map (kbd "M-=") #'bard/new-org-buffer)

  (defun bard/new-plain-buffer ()
    (interactive)
    (let ((xbuf (generate-new-buffer "*plain*")))
      (switch-to-buffer xbuf)
      (text-scale-increase 1.5)
      xbuf))

  (define-key global-map (kbd "M--") #'bard/new-plain-buffer)

  ;; elisp scratch buffer

  (defun bard/new-elisp-buffer ()
    (interactive)
    (let ((xbuf (generate-new-buffer "*elisp*")))
      (switch-to-buffer xbuf)
      (funcall (quote emacs-lisp-mode))
      (text-scale-increase 1.5)
      xbuf))
#+end_src

*** Terminals
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  (defun bard/open-terminal-in-current-directory ()
    "Open a terminal in the current working directory."
    (interactive)
    (let ((default-directory default-directory))
      (term "/usr/bin/env bash")))

  ;; (define-key global-map (kbd "C-t") #'bard/open-terminal-in-current-directory)
  (define-key global-map (kbd "C-z t") #'bard/open-terminal-in-current-directory)

  (defun bard/open-terminal-emulator ()
    "Open a terminal in the current working directory."
    (interactive)
    (let ((default-directory default-directory))
      (start-process "st terminal" nil "st")))

  (define-key global-map (kbd "C-z C-t") 'bard/open-terminal-emulator)

  (define-key global-map (kbd "C-z C-s") #'bard/new-elisp-buffer)
#+end_src

*** Time Management
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  ;; Modeline
  (setq display-time-format "%Y-%m-%d (%a) %H:%M")
  (setq display-time-interval 60)
  (setq display-time-default-load-average nil)
  (setq display-time-mail-directory nil)
  (setq display-time-mail-function nil)
  (setq display-time-use-mail-icon nil)
  (setq display-time-mail-string nil)
  (setq display-time-mail-face nil)
  (setq display-time-string-forms
        '((propertize
           (format-time-string display-time-format now)
           'face 'display-time-date-and-time
           'help-echo (format-time-string "%a %b %e, %Y" now))
          " "))
  (display-time-mode 1)

  ;; world clock
  (setq world-clock-list
        '(("America/New_York" "New York")
  	    ("Europe/Moscow" "Moscow")
  	    ("Europe/London" "London")
  	    ("Asia/Tokyo" "Tokyo")))

  (setq world-clock-time-format "%Y-%m-%d %B (%A) %R %Z")

  ;; timer package
  (use-package tmr
    :ensure t
    :config
    (setq tmr-notification-urgency 'normal)
    (setq tmr-sound-file nil)
    (setq tmr-timer-finished-functions '(tmr-notification-notify
                                         tmr-print-message-for-finished-timer
                                         tmr-acknowledge-minibuffer))
    (setq tmr-descriptions-list 'tmr-description-history)
    (define-key global-map (kbd "C-c t l") 'tmr-tabulated-view)
    (define-key global-map (kbd "C-c t t") #'tmr)
    (define-key global-map (kbd "C-c t T") #'tmr-with-description)
    (define-key global-map (kbd "C-c t l") #'tmr-tabulated-view)
    (define-key global-map (kbd "C-c t c") #'tmr-clone)
    (define-key global-map (kbd "C-c t k") #'tmr-cancel)
    (define-key global-map (kbd "C-c t s") #'tmr-reschedule)
    (define-key global-map (kbd "C-c t e") #'tmr-edit-description)
    (define-key global-map (kbd "C-c t r") #'tmr-remove)
    (define-key global-map (kbd "C-c t R") #'tmr-remove-finished))
#+end_src

*** Running emacs as server
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  (require 'server)
  (setq server-client-instructions nil)
  (unless (server-running-p)
    (server-start))
#+end_src

*** Provide module
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-essentials.el :mkdirp yes
  (provide 'bard-emacs-essentials)
#+end_src

** bard-emacs-media
*** EMMS music player
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-media.el :mkdirp yes
  (use-package emms
    :ensure t
    ;; :demand t
    :bind
    (:map emms-playlist-mode-map
          ("A" . emms-add-directory)
          ("l" . emms-add-playlist)
          ("T" . emms-add-directory-tree)
          ("F" . emms-add-file)
          ("U" . emms-add-url)
          ("L" . emms-toggle-repeat-track)
          ("<mouse-3>" . emms-pause)
          ("<SPC>" . emms-pause)
          ("c" . bard/emms-recenter)
          ("P" . emms-playlist-mode-shift-track-up)
          ("N" . emms-playlist-mode-shift-track-down)
          ("Z" . bard/save-emms-watch-later)
          ("Y" . bard/emms-download-current-video))
    :bind (("<f8>" . emms)
           ("M-<f8>" . emms-browser))
    :hook
    (emms-playlist-mode . hl-line-mode)
    :config
    (emms-all)
    (emms-default-players)
    (emms-mpris-enable)
    (setq emms-player-list '(emms-player-mpv))
    ;; emms-info-functions '(emms-info-native)

    ;; (setq emms-browser-covers 'emms-browser-cache-thumbnail)

    (setq emms-volume-amixer-card 0)

    ;; center line function
    (defun bard/emms-recenter ()
      (interactive)
      (recenter-top-bottom)
      (emms-playlist-mode-center-current))

    ;; modeline
    (emms-mode-line-disable)
    (emms-playing-time-disable-display)

    ;; playlist saving
    (setq bard/emms-playlist-format 'm3u)
    (setq bard/watch-later-file "~/Videos/watch-later.m3u")
    )
#+end_src

*** PDF viewer (~pdf-tools~)
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-media.el :mkdirp yes
  (use-package pdf-tools
    :ensure t
    :config
    (pdf-tools-install)
    (add-to-list 'pdf-tools-enabled-modes #'pdf-view-themed-minor-mode))
#+end_src

*** Custom functions
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-media.el :mkdirp yes
  (use-package bard-media
    :ensure nil
    :config
    (require 'bard-media)
    :bind
    (("C-c o p" . bard/play-youtube-video)
     ("C-c o i" . bard/image-browser))
    )
#+end_src

*** Provide module
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-media.el :mkdirp yes
  (provide 'bard-emacs-media)
#+end_src

