config.org
** bard-emacs-prog
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-prog.el :mkdirp yes
(use-package haskell-mode
  :ensure t
  :config
  (setq haskell-interactive-popup-errors nil))

;; CPP Mode
(use-package emacs
  :config
  (setq-default c-basic-offset 4)
  (setq c-default-style '((c-mode . "gnu")
                          (java-mode . "java")
                          (awk-mode . "awk"))))

;; Haskell

(use-package emacs
  :config
  (add-to-list 'exec-path "$HOME/.ghcup/bin")
  (add-to-list 'exec-path "/home/bard/.cabal/bin")
  (add-to-list 'exec-path "/home/bard/.local/bin")
  (add-to-list 'exec-path "/home/bard/opt/")
  (let ((bard/ghcup-path (expand-file-name "~/.ghcup/bin")))
    (setenv "PATH" (concat bard/ghcup-path ":" (getenv "PATH")))
    (add-to-list 'exec-path bard/ghcup-path)))

;; Lisp
(use-package clojure-mode
  :ensure t)

(use-package cider
  :ensure t)

(use-package sly
  :ensure t
  :config
  (setq inferior-lisp-program (executable-find "sbcl")))

(use-package geiser
  :ensure t)

(use-package geiser-gauche
  :ensure t)

;; parens packages

(use-package c++-mode
  :ensure nil
  :bind
  (:map c++-mode-map
        ("C-c C-c" . project-compile))
  :config
  (defun bard/c++-completion-or-indent ()
    "Complete if point is at a symbol; otherwise, indent."
    (interactive)
    (if (or (completion-at-point) (looking-at "\\_>"))
        (completion-at-point)
      (c-indent-line-or-region)))

  (defun bard/setup-c++-mode ()
    "Configure completion behavior for `c++-mode'."
    (local-set-key (kbd "<tab>") 'bard/c++-completion-or-indent))

  (add-hook 'c++-mode-hook #'bard/setup-c++-mode)
  (add-hook 'c-mode-hook #'bard/setup-c++-mode)
  )

(use-package flycheck
  :ensure t
  :config
  (global-flycheck-mode t))

(use-package ggtags
  :ensure t
  :config
  (add-hook 'c-mode-common-hook
            (lambda ()
              (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
                (ggtags-mode 1)
                (setq-local imenu-create-index-function #'ggtags-build-imenu-index)))
            ))

(use-package compile
  :ensure nil
  :defer 2
  :config
  (require 'bard-compile)
  (setq compilation-scroll-output t
        compilation-auto-jump-to-first-error nil)
  )

;; Version control
(use-package magit
  :ensure t
  :config
  (setq magit-repository-directories
        '(("~/Code"                    . 1)
          ("~/Repositories"            . 1)
          ("~/dotfiles-stow"           . 0)
          ("~/.emacs.d"                . 0)
          ("~/Pictures/wallpaper"      . 0)))
  :bind ("C-c g" . magit-status)
  )

;; (use-package ada-mode
;;   :load-path "~/.emacs.d/old-ada"
;;   :bind
;;   (:map ada-mode-map
;; 	("C-j" . dired-jump)))

(provide 'bard-emacs-prog)

#+end_src

** bard-emacs-theme
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-theme.el :mkdirp yes
  (require 'bard-theme)

  ;; declare all themes as safe (i trust developers)
  (setq custom-safe-themes t)

  (use-package ef-themes
    :ensure t
    :demand t
    :hook
    ((ef-themes-post-load . bard/ef-themes-hl-todo-faces)
     (ef-themes-post-load . logos-update-fringe-in-buffers))
    :config
    (defun bard/ef-themes-hl-todo-faces ()
      "Configure `hl-todo-keyword-faces' with Ef themes colors.
  The exact color values are taken from the active Ef theme."
      (ef-themes-with-colors
        (setq hl-todo-keyword-faces
              `(("WAIT" . ,yellow)
                ("TODO" . ,red)
                ("NEXT" . ,blue)
                ("THEM" . ,magenta)
                ("PROG" . ,cyan-warmer)
                ("OKAY" . ,green-warmer)
                ("DONT" . ,yellow-warmer)
                ("FAIL" . ,red-warmer)
                ("BUG" . ,red-warmer)
                ("DONE" . ,green)
                ("NOTE" . ,blue-warmer)
                ("KLUDGE" . ,cyan)
                ("HACK" . ,cyan)
                ("TEMP" . ,red)
                ("FIXME" . ,red-warmer)
                ("XXX+" . ,red-warmer)
                ("KILLED" . ,cyan)
                ("REVIEW" . ,red)
                ("DEPRECATED" . ,yellow)))))

    (setq org-priority-faces
          '((?A . (:inherit (bold next-error)))
            (?B . org-priority)
            (?C . (:inherit (shadow org-priority)))))

    ;; (setq ef-themes-headings
    ;;       '((0 variable-pitch bold 1.5)
    ;;         (1 variable-pitch bold 1.3)
    ;;         (2 regular 1.2)
    ;;         (3 1.1)
    ;;         (agenda-date . (variable-pitch bold 1.3))
    ;;         (agenda-structure . (variable-pitch bold 1.5))
    ;;         (t . 1.1)))

    (setq ef-themes-headings
          '((0 . (variable-pitch light 1.5))
            (1 . (variable-pitch light 1.3))
            (2 . (regular 1.2))
            (t . (variable-pitch 1.1))
            (agenda-date . (variable-pitch bold 1.3))
            (agenda-structure . (variable-pitch bold 1.5))))

    ;; better faces in overrides
    (setq ef-themes-common-palette-overrides
          `((fringe unspecified)
            (bg-line-number-active bg-hl-line)
            (bg-line-number-inactive unspecified)
            (fg-line-number-active fg-main)
            (bg-tab-bar bg-dim)))

    ;; verbatim need higher contrast for org mode
    (setq ef-elea-dark-palette-overrides
          '((prose-verbatim yellow-cooler)))

    (setq ef-elea-light-palette-overrides
          '((prose-verbatim yellow-cooler)))

    (define-key global-map (kbd "M-<f5>") #'ef-themes-select)
    (setq ef-themes-variable-pitch-ui t
          ef-themes-mixed-fonts t))

  (use-package doom-themes
    :ensure t
    :config
    (setq doom-gruvbox-dark-variant "hard")
    (bard/select-theme 'doom-gruvbox)
    )

  (use-package gruber-darker-theme
    :ensure t
    :vc (:url "https://github.com/BardofSprites/gruber-darker-theme"
         :rev newest))

  ;;;; Fonts
  (use-package fontaine
    :ensure nil
    :config
    ;; save file
    (setq fontaine-latest-state-file
          (locate-user-emacs-file "fontaine-latest-state.eld"))

    ;; Set last preset or fall back to desired style from `fontaine-presets'.
    (fontaine-set-preset (or (fontaine-restore-latest-preset) 'default))

    ;; The other side of `fontaine-restore-latest-preset'.
    (add-hook 'kill-emacs-hook #'fontaine-store-latest-preset)

    ;; preserve fonts when switching themes
    (dolist (hook '(modus-themes-after-load-theme-hook ef-themes-post-load-hook))
      (add-hook hook #'fontaine-apply-current-preset))

    (define-key global-map (kbd "C-c f") #'fontaine-set-preset))

  (use-package rainbow-mode
    :ensure t)

  (global-set-key (kbd "M-<f6>") #'bard/select-theme)

  (use-package mixed-pitch
    :ensure t
    :hook
    (org-mode . mixed-pitch-mode)
    )

  (use-package spacious-padding
    :ensure t
    :config
    (setq spacious-padding-widths
          '( :internal-border-width 10
             :header-line-width 4
             :mode-line-width 6
             :tab-width 4
             :right-divider-width 1
             :left-fringe-width 0
             :right-fringe-width 0
             :scroll-bar-width 0))
    (spacious-padding-mode t))

  (provide 'bard-emacs-theme)

  ;;; bard-emacs-theme.el ends here

#+end_src

