config.org
** bard-emacs-writing
#+begin_src emacs-lisp :tangle bard-emacs-modules/bard-emacs-writing.el :mkdirp yes
;;; Input related settings

(use-package emacs
  :ensure nil
  :demand t
  :bind
  (("C-x i" . insert-char)
   ("M-z"   . zap-to-char)
   ("<f10>"  . toggle-input-method))
  :config
  ;; Sentence size
  (setq sentence-end-double-space nil)

  ;; Keyboard things
  (setq default-input-method "cyrillic-yawerty")
  (setq default-transient-input-method "cyrillic-yawerty"))

(use-package text-mode
  :ensure nil
  :hook
  (text-mode . flyspell-mode))

;; Tab settings
(use-package emacs
  :config
  (setq tab-always-indent 'complete)
  (setq tab-first-completion 'word-or-paren-or-punct)
  (setq-default tab-width 4
                indent-tabs-mode nil))

(use-package electric
  :hook
  (prog-mode . electric-indent-local-mode)
  (prog-mode . electric-pair-local-mode))

(use-package paren
  :hook (prog-mode . show-paren-local-mode)
  :config
  (setq show-paren-style 'parenthesis)
  (setq show-paren-when-point-in-periphery nil)
  (setq show-paren-when-point-inside-paren nil)
  (setq show-paren-context-when-offscreen 'overlay))

;; snippets
(use-package yasnippet
  :ensure t
  :config
  (setq yas-snippet-dirs '("~/.emacs.d/snippets"))
  (yas-global-mode t)
  )

(use-package yasnippet-capf
  :ensure t
  :after cape
  :config
  (add-to-list 'completion-at-point-functions #'yasnippet-capf))

;;; Notes
(use-package denote
  :ensure t
  :config
  (require 'bard-writing)
  (setq denote-directory "~/Notes/denote/")
  (setq denote-buffer-name-prefix "[Note] "
        denote-rename-buffer-format "%t %b")
  (setq denote-known-keywords
        '("emacs"
          "linux"
          "programming"
          "org"
          "school"
          "language"
          "history"
          "biology"
          ))

  (setq denote-templates
        '((default . "Related to — ")
          (todo . bard/denote-todo-template)))

  (setq denote-save-buffers t)
  (setq denote-prompts '(title keywords))
  (setq denote-sort-dired-extra-prompts nil)
  (setq denote-sort-dired-default-sort-component 'identifier)
  (setq denote-sort-dired-default-reverse-sort nil)

  ;; backlinks sidebar
  (setq denote-backlinks-display-buffer-action
        '((display-buffer-in-direction)
          (direction . right)
          (window-width . 0.33)
          (window-height . fit-window-to-buffer)
          (dedicated . t)))

  (denote-rename-buffer-mode 1)

  (require 'bard-writing)

  :hook
  (dired-mode . denote-dired-mode)
  :bind
  (("C-c n n" . denote)
   ("C-c n d" . denote-sort-dired)
   ("C-c n r" . denote-rename-file-using-front-matter)
   ("C-c n k" . denote-rename-file-keywords)
   ("C-c n I" . denote-add-links)
   ("C-c n b" . bard/consult-buffer-notes)   ; notes buffer
   ("C-c n B" . bard/ibuffer-notes)          ; notes buffer but more
   ("C-c n f" . bard/find-notes-file)        ; notes-find
   ("C-c n g" . bard/search-notes-directory))) ; notes-grep

(use-package denote-org
  :ensure t
  )

(use-package denote-silo
  :ensure t
  :config
  (setq denote-silo-directories '("~/Notes/denote"
                                  "~/Notes/Old Notes/"))
  )

(use-package denote-sequence
  :ensure t
  :config
  (require 'bard-writing)
  :bind
  ("C-c n N" . denote-sequence)
  ("C-c n D" . denote-sequence-dired)
  ("C-c n <SPC>" . denote-sequence-region))

(use-package denote-journal
  :ensure t
  :bind
  ("C-c n j" . denote-journal-new-or-existing-entry)
  :config
  (setq denote-journal-directory "~/Notes/denote/journal/")

  (setq denote-journal-title-format "Daily Tasks and Notes")
  )

(use-package denote-roam
  :ensure nil
  :load-path "~/Code/denote-roam/"
  :bind
  ("C-c n i" . denote-roam-insert-or-create-node)  ; node insert
  ("C-c n o" . denote-roam-find-or-create-node)    ; node open
  :custom
  (denote-roam-include-journal nil)
  (denote-roam-directory "~/Notes/denote")
  :config
  (denote-roam-mode t))

;;;; Org Roam
(use-package org-roam
  :ensure t
  :custom
  (org-roam-directory (file-truename "~/Notes/denote"))
  :bind (("C-c n l" . org-roam-buffer-toggle))
  :config
  (setq org-roam-db-node-include-function
        (lambda ()
          (not (member "ATTACH" (org-get-tags)))))

  (org-roam-db-autosync-mode 1))

(use-package org-roam-ui
  :ensure t
  :bind
  ("C-c n u" . org-roam-ui-open)
  :custom
  (org-roam-ui-open-on-start nil))

;;; Focus mode for writing

;; Center line scrolling for focused writing
(use-package emacs
  :config
  (define-minor-mode bard/scroll-center-cursor-mode
    "Toggle centered cursor scrolling behavior."
    :init-value nil
    :lighter " S="
    :global nil
    (if bard/scroll-center-cursor-mode
        (setq-local scroll-margin (* (frame-height) 2)
                    scroll-conservatively 0
                    maximum-scroll-margin 0.5)
      (dolist (local '(scroll-preserve-screen-position
                       scroll-conservatively
                       maximum-scroll-margin
                       scroll-margin))
        (kill-local-variable `,local))))
  (defun bard/cursor-centered-p ()
    "Check if `bard/scroll-center-cursor-mode` is currently active."
    (bound-and-true-p bard/scroll-center-cursor-mode))
  :bind
  (("C-c L" . bard/scroll-center-cursor-mode)))

(use-package olivetti
  :ensure t
  :config
  (setq olivetti-minimum-body-width 90)
  (setq olivetti-recall-visual-line-mode-entry-state t)
  :hook
  ((olivetti-mode-on . (lambda () (olivetti-set-width 90)))
   ))

;; narrowing and focus mode
(use-package logos
  :ensure t
  :config
  (defun logos-reveal-entry ()
    "Reveal Org or Outline entry."
    (cond
     ((and (eq major-mode 'org-mode)
           (org-at-heading-p))
      (org-show-subtree))
     ((or (eq major-mode 'outline-mode)
          (bound-and-true-p outline-minor-mode))
      (outline-show-subtree))))

  (setq logos-outlines-are-pages t)

  (setq logos-outline-regexp-alist
        `((emacs-lisp-mode . "^;;;+ ")
          (org-mode . "^\\* +")
          (t . ,(or outline-regexp logos--page-delimiter))))

  (setq-default logos-hide-cursor nil
                logos-hide-mode-line nil
                logos-hide-header-line t
                logos-hide-buffer-boundaries t
                logos-hide-fringe t
                logos-variable-pitch t
                logos-olivetti t)

  (defun bard/logos--recenter-top ()
    "Use `recenter' to reposition the view at the top."
    (unless (derived-mode-p 'prog-mode)
      (recenter 1))) ; Use 0 for the absolute top
  :hook
  ((logos-page-motion . bard/logos--recenter-top))
  :hook
  ((org-mode . logos-focus-mode)
   (markdown-mode . logos-focus-mode))
  :bind
  (("M-]" . logos-forward-page-dwim)
   ("M-[" . logos-backward-page-dwim)
   ("<f9>" . logos-focus-mode)
   ("C-x n n" . logos-narrow-dwim)))

(use-package citar
  :ensure t
  :bind
  ("C-c n c" . citar-open)
  :config
  (setq citar-bibliography '("~/Documents/bib/references.bib"))
  (setq org-cite-global-bibliography citar-bibliography
        org-cite-insert-processor 'citar
        org-cite-follow-processor 'citar
        org-cite-activate-processor 'citar)

  (setq citar-notes-paths '("~/Notes/denote"))
  (setq citar-library-paths '("~/Documents/Research Articles/"))
  ;; (setq citar-file-open-functions 'find-file)
  :hook
  (org-mode . citar-capf-setup)
  :bind (("C-c i" . citar-insert-citation))
  )

(use-package citar-denote
  :ensure t
  :config
  (citar-denote-mode t)
  )

(use-package citar-embark
  :ensure t
  )

(provide 'bard-emacs-writing)

#+end_src

* Libraries
** bard-calendar
#+begin_src emacs-lisp :tangle bard-elisp/bard-calendar.el :mkdirp yes
(require 'org)

;; Org Clock

(defun bard/auto-clock-in ()
  "Automatically clock in when task marked in progress (INPROG),
 and start study session."
  (when (equal (org-get-todo-state) "INPROG")
    (org-clock-in)
    (bard/study-session)))

(defun bard/study-session ()
  "Prompt for study parameters, run study session, and clock out when done."
  (interactive)
  (let* ((study-time (read-string "Study time (minutes): "))
         (break-time (read-string "Break time (minutes): "))
         (sessions (read-string "Number of sessions: "))
         (command (format "study %s %s %s" study-time break-time sessions))
         (process (start-process-shell-command "study-session" "*study*" command)))
    (set-process-sentinel
     process
     (lambda (_proc event)
       (when (string= event "finished\n")
         (progn (org-clock-out)
                (pop-to-buffer-same-window "todo.org")))))))

(defun bard/org-clock-report ()
  (interactive)
  (bard/new-org-buffer)
  (org-clock-report))

(defun bard/org-clock-update-mode-line ()
  (interactive)
  (setq org-mode-line-string nil)
  (force-mode-line-update))

(defun bard/org-clock-task-string ()
  "Return a simplified org clock task string."
  (if (and (boundp 'org-mode-line-string)
           (not (string-equal "" org-mode-line-string))
           org-mode-line-string)
      (substring-no-properties org-mode-line-string)
    "No task clocked in"))

(defun bard/open-calendar ()
  "Opens calendar as only window"
  (interactive)
  (calendar)
  (delete-other-windows))

;; Org Agenda

(defun bard/choose-agenda ()
  "For viewing my custom agenda"
  (interactive)
  (let ((agenda-views '("Default" "Monthly" "Yearly")))
    (setq chosen-view (completing-read "Choose an agenda view: " agenda-views))
    (cond
     ((string= chosen-view "Yearly")
      (org-agenda nil "Y"))
     ((string= chosen-view "Monthly")
      (org-agenda nil "M"))
     ((string= chosen-view "Default")
      (org-agenda nil "D")))))

(defun bard/default-agenda ()
  "For viewing my custom agenda"
  (interactive)
  (org-agenda nil "D"))

(provide 'bard-calendar)
;;; bard-calendar.el ends here

#+end_src

** bard-compile
#+begin_src emacs-lisp :tangle bard-elisp/bard-compile.el :mkdirp yes
;; Stolen from (http://endlessparentheses.com/ansi-colors-in-the-compilation-buffer-output.html)
(require 'ansi-color)
(defun endless/colorize-compilation ()
  "Colorize from `compilation-filter-start' to `point'."
  (let ((inhibit-read-only t))
    (ansi-color-apply-on-region
     compilation-filter-start (point))))

(add-hook 'compilation-filter-hook
          #'endless/colorize-compilation)

;; Stolen from (https://oleksandrmanzyuk.wordpress.com/2011/11/05/better-emacs-shell-part-i/)
(defun regexp-alternatives (regexps)
  "Return the alternation of a list of regexps."
  (mapconcat (lambda (regexp)
               (concat "\\(?:" regexp "\\)"))
             regexps "\\|"))

(defvar non-sgr-control-sequence-regexp nil
  "Regexp that matches non-SGR control sequences.")

(setq non-sgr-control-sequence-regexp
      (regexp-alternatives
       '(;; icon name escape sequences
         "\033\\][0-2];.*?\007"
         ;; non-SGR CSI escape sequences
         "\033\\[\\??[0-9;]*[^0-9;m]"
         ;; noop
         "\012\033\\[2K\033\\[1F"
         )))

(defun filter-non-sgr-control-sequences-in-region (begin end)
  (save-excursion
    (goto-char begin)
    (while (re-search-forward
            non-sgr-control-sequence-regexp end t)
      (replace-match ""))))

(defun filter-non-sgr-control-sequences-in-output (ignored)
  (let ((start-marker
         (or comint-last-output-start
             (point-min-marker)))
        (end-marker
         (process-mark
          (get-buffer-process (current-buffer)))))
    (filter-non-sgr-control-sequences-in-region
     start-marker
     end-marker)))

(add-hook 'comint-output-filter-functions
          'filter-non-sgr-control-sequences-in-output)

(provide 'bard-compile)

#+end_src

