config.org
** bard-package
#+begin_src emacs-lisp :tangle bard-elisp/bard-package.el :mkdirp yes
;; taken and renamed functions from https://manueluberti.eu/posts/2021-09-01-package-report/

(defun bard/package-report ()
  "Report total package counts grouped by archive."
  (interactive)
  (package-refresh-contents)
  (bard/display-package-report
   (let* ((arch-pkgs (bard/archive-packages))
          (counts (seq-sort-by #'cdr #'> (bard/archive-counts arch-pkgs)))
          (by-arch (seq-group-by #'car arch-pkgs)))
     (concat
      (format "Total packages: %s\n\n" (apply #'+ (mapcar #'cdr counts)))
      (mapconcat
       (lambda (archive)
         (concat "• "
                 (format "%s (%s)" (car archive) (cdr archive))
                 ": "
                 (mapconcat (lambda (ap-pair) (cdr ap-pair))
                            (alist-get (car archive) by-arch)
                            ", ")))
       counts
       "\n\n")))))

(defun bard/display-package-report (output)
  "Display OUTPUT in a popup buffer."
  (let ((buffer-name "*package-report*"))
    (with-help-window buffer-name
      (with-current-buffer buffer-name
        (visual-line-mode 1)
        (erase-buffer)
        (insert output)
        (goto-char (point-min))))))

(defun bard/archive-packages ()
  "Return a list of (archive . package) cons cells."
  (seq-reduce
   (lambda (res package)
     (let ((archive (package-desc-archive
                     (cadr (assq package package-archive-contents))))
           (pkg (symbol-name package)))
       (push (cons archive pkg) res)))
   (mapcar #'car package-alist)
   nil))

(defun bard/archive-counts (arch-pkgs)
  "Return a list of cons cells from alist ARCH-PKGS.
The cars are package archives, the cdrs are the number of
packages installed from each archive."
  (seq-reduce
   (lambda (counts key)
     (cons (cons key (+ 1 (or (cdr (assoc key counts)) 0)))
           (assoc-delete-all key counts)))
   (mapcar #'car arch-pkgs)
   nil))

(provide 'bard-package)

#+end_src

** bard-theme
#+begin_src emacs-lisp :tangle bard-elisp/bard-theme.el :mkdirp yes
  (setq fontaine-presets
          '((default
             :default-height 140
             :default-family "Iosevka Comfy"
             :variable-pitch-family "Iosevka Comfy"
             :variable-pitch-height 1.0
             :fixed-pitch-family "Iosevka Comfy"
             :fixed-pitch-height 1.0
             :bold-weight bold
             )
            (tiny
             :inherit default
             :default-height 135)
            (wide
             :default-height 135
             :default-family "Iosevka Comfy Wide"
             :fixed-pitch-family "Iosevka Comfy Wide"
             :variable-pitch-family "Iosevka Comfy Wide Motion Duo")
            (prot
             :default-family "Iosevka Comfy Wide Motion"
             :default-height 130
             :default-weight medium
             :fixed-pitch-family "Iosevka Comfy Wide Motion"
             :variable-pitch-family "Iosevka Comfy Wide Duo"
             :bold-weight extrabold)
            (mono
             :default-height 130
             :default-family "monospace"
             :fixed-pitch-family "monospace"
             :variable-pitch-family "Baskerville"
             :variable-pitch-height 140)
            (mono-large
             :inherit mono
             :default-height 150
             :variable-pitch-height 160)
            (mac
             :default-height 130
             :default-family "Monaco"
             :variable-pitch-family "Monaco"
             :fixed-pitch-family "Monaco")
            (large
             :inherit default
             :default-height 160
             )
            (huge
             :inherit default
             :default-height 180
             )
            (t
             :default-family "Monospace"
             )))

  (set-fontset-font
   t 'han
   (font-spec :family "Noto Serif CJK JP") nil 'prepend)

  ;;; Switching themes
  (defun bard/disable-all-themes ()
    "disable all active themes."
    (interactive)
    (dolist (i custom-enabled-themes)
      (disable-theme i)))

  (defvar bard/after-theme-load-hook nil
    "Hook that runs after a new theme is loaded using `bard/select-theme`.")

  (dolist (hook '(bard/after-theme-load-hook))
    (add-hook hook #'fontaine-apply-current-preset)
    (add-hook hook #'logos-update-fringe-in-buffers))

  (defun bard/select-theme (&optional theme)
    "Enable the specified THEME, or prompt the user to select one if THEME is nil."
    (interactive
     (list
      (completing-read "Select theme: "
                       (mapcar 'symbol-name (custom-available-themes)))))
    (let* ((theme-symbol (if (symbolp theme) theme (intern theme)))
           (theme-name (symbol-name theme-symbol))
           (display-theme-name (if (string-suffix-p "-theme" theme-name)
                                   (substring theme-name 0 -6)
                                 theme-name))
           (colored-theme-name (propertize display-theme-name 'face '(:weight bold))))
      (bard/disable-all-themes)
      (load-theme theme-symbol t)
      (message "Loaded the %s theme" colored-theme-name)
      (run-hooks 'bard/after-theme-load-hook)))

  (defun bard/update-ryo-cursor-color ()
    "Update the color variable of `ryo-modal-mode' cursor to match the ef/modus theme."
    (let ((active-theme (car custom-enabled-themes))
          (cursor-color nil))
      (cond
       ((and (fboundp 'ef-themes-with-colors)
             (string-prefix-p "ef-" (symbol-name active-theme)))
        (ef-themes-with-colors
          (setq ryo-modal-cursor-color cursor
                ryo-modal-default-cursor-color cursor)))
       ((and (fboundp 'modus-themes-with-colors)
             (string-prefix-p "modus-" (symbol-name active-theme)))
        (modus-themes-with-colors
          (setq ryo-modal-cursor-color cursor
                ryo-modal-default-cursor-color cursor)))
       (t (setq cursor-color "red"))
       (setq ryo-modal-cursor-color cursor-color
             ryo-modal-default-cursor-color cursor-color))))

  (defvar my-last-cursor-type nil)

  (defun bard/update-cursor-type ()
    "Set cursor type to 'bar in text modes, 'box otherwise.
  leave it alone in pdf-view-mode."
    (unless (derived-mode-p 'pdf-view-mode)
      (let ((new-cursor (if (derived-mode-p 'text-mode) 'bar 'box)))
        (unless (eq my-last-cursor-type new-cursor)
          (setq cursor-type new-cursor)
          (setq my-last-cursor-type new-cursor)))))

  (add-hook 'post-command-hook #'bard/update-cursor-type)

  (defun bard/outline-heading-faces ()
    (set-face-attribute 'org-level-1 nil
                        :inherit '(outline-1 variable-pitch)
                        :weight 'light
                        :height 1.5)

    (set-face-attribute 'org-level-2 nil
                        :inherit '(outline-2 variable-pitch)
                        :weight 'light
                        :height 1.3)

    (set-face-attribute 'org-level-3 nil
                        :inherit 'outline-3
                        :height 1.2)

    (set-face-attribute 'org-level-4 nil
                        :inherit '(outline-4 variable-pitch)
                        :height 1.1)

    (set-face-attribute 'org-level-5 nil
                        :inherit '(outline-5 variable-pitch)
                        :height 1.1)

    (set-face-attribute 'org-level-6 nil
                        :inherit '(outline-6 variable-pitch)
                        :height 1.1)
    
    (set-face-attribute 'org-agenda-date nil
                        :inherit 'variable-pitch
                        :weight 'bold
                        :height 1.3)

    (set-face-attribute 'org-agenda-structure nil
                        :inherit 'variable-pitch
                        :weight 'bold
                        :height 1.5))

  (add-hook 'bard/after-theme-load-hook #'bard/outline-heading-faces)

  (provide 'bard-theme)

#+end_src

